#include <iostream>  // Підключаємо бібліотеку для введення та виведення даних
#include <cmath>     // Підключаємо математичні функції: sin cos pow exp
#include <windows.h> // Потрібна для налаштування кодування консолі Windows

using namespace std; // Дозволяє не писати std:: перед cout cin та endl

int main()
{
    // Встановлюємо UTF-8 для правильного відображення українських символів
    SetConsoleOutputCP(CP_UTF8);

    // Встановлюємо UTF-8 для правильного введення українських символів
    SetConsoleCP(CP_UTF8);

    // ==========================================
    // ЗАВДАННЯ 1
    // ==========================================
    // Оголошуємо змінні A B C для введення значень
    // та X для збереження результату обчислення
    double A, B, C, X;

    // Просимо користувача ввести значення A
    cout << "Введіть A: ";
    cin >> A;

    // Просимо користувача ввести значення B
    cout << "Введіть B: ";
    cin >> B;

    // Просимо користувача ввести значення C
    cout << "Введіть C: ";
    cin >> C;

    // Обчислюємо знаменник формули:
    double denominator = exp(A) + 1 + sin(B);

    // Перевіряємо чи не дорівнює знаменник нулю.
    // Ділити число на нуль не можна.
    if (denominator == 0)
    {
        // Якщо знаменник дорівнює нулю
        // виводимо повідомлення про помилку
        cout << "Помилка: знаменник дорівнює нулю!" << endl;
    }
    else
    {
        // Якщо знаменник не дорівнює нулю
        // можемо виконувати основне обчислення.
        X = pow(sin(C), 3) * pow(cos(A), 2) / denominator;

        // Виводимо отримане значення X на екран
        cout << "X = " << X << endl;
    }

    // ==========================================
    // ЗАВДАННЯ 2
    // ==========================================
    double P, d;

    // Просимо користувача вести периметр
    cout << "Введіть периметр P: ";
    cin >> P;

    // Перевіряємо чи є периметр додатним
    // Периметр не може бути меншим або дорівнювати нулю
    if (P <= 0)
    {
        // Якщо P менше або дорівнює нулю
        // виводимо повідомлення про помилку
        cout << "Помилка: периметр повинен бути більшим за 0!" << endl;
    }
    else
    {
        // Якщо периметр правильний
        d = P / 4;

        // Виводимо результат на екран
        cout << "Наймеша діагональ = " << d << endl;
    }

    // Повертаємо 0 що означає успішне завершення програми
    return 0;
}